---
kind: method
id: M:Autodesk.Revit.DB.FailureMessage.GetDescriptionText
source: html/129f471b-f6bf-61b4-4556-abc72f621f6c.htm
---
# Autodesk.Revit.DB.FailureMessage.GetDescriptionText Method

Retrieves the description text of the failure.

## Syntax (C#)
```csharp
public string GetDescriptionText()
```

## Returns
The description text.